## **[MySQL UPDATE](https://www.mysqltutorial.org/mysql-update-data.aspx)**

Use the MySQL UPDATE statement to update data in a table.

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    'display.max_colwidth', None,
    'display.max_rows', 10,
)

pd.set_option('display.width', 65)

In [2]:
# connect to the classicmodels database
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### Introduction to MySQL UPDATE statement

syntax

UPDATE [LOW_PRIORITY] [IGNORE] table_name 
SET 
    column_name1 = expr1,
    column_name2 = expr2,
    ...
[WHERE
    condition];

### MySQL UPDATE examples

#### 1) Using MySQL UPDATE to modify values in a single column example

In [3]:
# origin email address
string = '''
SELECT firstName, lastName, email
FROM employees
WHERE employeeNumber = 1056
;'''

pd.read_sql(string, engine)

  firstName   lastName                           email
0      Mary  Patterson  mpatterso@classicmodelcars.com

In [4]:
# change the email address from 'mpatterso@classicmodelcars.com'
# to 'mary.patterson@classicmodelcars.com'
string_change = '''
UPDATE employees
SET email = 'mary.patterson@classicmodelcars.com'
WHERE employeeNumber = 1056
;'''

engine.execute(string_change)

df1 = pd.read_sql(string, engine)

# recover the original email address
string_change = '''
UPDATE employees
SET email = 'mpatterso@classicmodelcars.com'
WHERE employeeNumber = 1056
;'''

engine.execute(string_change)

df1

  firstName   lastName                                email
0      Mary  Patterson  mary.patterson@classicmodelcars.com

In [5]:
df2 = (
    pd.read_sql_table('employees', engine)
    .query("employeeNumber == 1056")
    .assign(email = 'mary.patterson@classcimodelscars.com')
    [['firstName', 'lastName', 'email']]
    .reset_index(drop=True)
)

df2

  firstName   lastName                                 email
0      Mary  Patterson  mary.patterson@classcimodelscars.com

#### 2) Using MySQL UPDATE to modify values in multiple columns

In [6]:
string_change = '''
UPDATE employees
SET
    lastName = 'Hill',
    email = 'mary.hill@classicmodelcars.com'
WHERE employeeNumber = 1056
;'''

engine.execute(string_change)

df1 = pd.read_sql(string, engine)

# recover the origin lastName and email address
string_change = '''
UPDATE employees
SET
    lastName = 'Patterson',
    email = 'mpatterso@classicmodelcars.com'
WHERE employeeNumber = 1056
;'''

engine.execute(string_change)

df1

  firstName lastName                           email
0      Mary     Hill  mary.hill@classicmodelcars.com

In [7]:
df2 = (
    pd.read_sql_table('employees', engine)
    .query('employeeNumber == 1056')
    .assign(lastName = 'Hill',
            email = 'mary.hill@classicmodelcars.com')
    [['firstName', 'lastName', 'email']]
    .reset_index(drop=True)
)

df2

  firstName lastName                           email
0      Mary     Hill  mary.hill@classicmodelcars.com

#### 3) Using MySQL UPDATE to replace string example

In [8]:
string = '''
SELECT firstName, lastName, email, jobTitle, officeCode
FROM employees
WHERE jobTitle = 'Sales Rep' AND officeCode = 6
;'''

pd.read_sql(string, engine)

,firstName,lastName,email,jobTitle,officeCode
0,Andy,Fixter,afixter@classicmodelcars.com,Sales Rep,6
1,Peter,Marsh,pmarsh@classicmodelcars.com,Sales Rep,6
2,Tom,King,tking@classicmodelcars.com,Sales Rep,6

In [9]:
# replace the email address
string_change = '''
UPDATE employees
SET email = REPLACE(email, '@classicmodelcars.com', '@mysqltutorial.org')
WHERE jobTitle = 'Sales Rep' AND officeCode = 6
;'''

engine.execute(string_change)

df1 = pd.read_sql(string, engine)

# recover the original email address
string_change = '''
UPDATE employees
SET email = REPLACE(email, '@mysqltutorial.org', '@classicmodelcars.com')
WHERE jobTitle = 'Sales Rep' AND officeCode = 6
;'''

engine.execute(string_change)

df1

,firstName,lastName,email,jobTitle,officeCode
0,Andy,Fixter,afixter@mysqltutorial.org,Sales Rep,6
1,Peter,Marsh,pmarsh@mysqltutorial.org,Sales Rep,6
2,Tom,King,tking@mysqltutorial.org,Sales Rep,6

In [10]:
pd.read_sql(string, engine)

,firstName,lastName,email,jobTitle,officeCode
0,Andy,Fixter,afixter@classicmodelcars.com,Sales Rep,6
1,Peter,Marsh,pmarsh@classicmodelcars.com,Sales Rep,6
2,Tom,King,tking@classicmodelcars.com,Sales Rep,6

In [11]:
df2 = (
    pd.read_sql_table('employees', engine)
    .query("jobTitle == 'Sales Rep' and officeCode == '6'")
    .assign(email = lambda df: df.email.str.replace(
        '@classicmodelcars.com', '@mysqltutorial.org', regex=False))
    [['firstName', 'lastName', 'email', 'jobTitle', 'officeCode']]
    .reset_index(drop=True)
)

df2

,firstName,lastName,email,jobTitle,officeCode
0,Andy,Fixter,afixter@mysqltutorial.org,Sales Rep,6
1,Peter,Marsh,pmarsh@mysqltutorial.org,Sales Rep,6
2,Tom,King,tking@mysqltutorial.org,Sales Rep,6

#### 4) Using MySQL UPDATE to update rows returned by a SELECT statement example

In [12]:
# query the customers that have no sales representative
string = '''
SELECT customerNumber, customerName, salesRepEmployeeNumber
FROM customers
WHERE salesRepEmployeeNumber IS NULL
;'''

customers_no_sales_rep = pd.read_sql(string, engine)
customers_no_sales_rep.head(3)

,customerNumber,customerName,salesRepEmployeeNumber
0,125,Havel & Zbyszek Co,None
1,169,Porto Imports Co.,None
2,206,"Asian Shopping Network, Co",None

In [13]:
customers_no_sales_rep.customerNumber.values

array([125, 169, 206, 223, 237, 247, 273, 293, 303, 307, 335, 348, 356,
       361, 369, 409, 443, 459, 465, 477, 480, 481])

In [14]:
# randomly select one sales representative from employees table
string_rand = '''
SELECT employeeNumber
FROM employees
WHERE jobtitle = 'Sales Rep'
ORDER BY RAND()
LIMIT 1
;'''

pd.read_sql(string_rand, engine)

   employeeNumber
0            1165

In [15]:
# update salesRepEmployeeNumber of customers table
# from randomly selected employeeNumber of employees table
string_change = '''
UPDATE customers
SET salesRepEmployeeNumber = (
    SELECT employeeNumber
    FROM employees
    WHERE jobtitle = 'Sales Rep'
    ORDER BY RAND()
    LIMIT 1)
WHERE salesRepEmployeeNumber IS NULL
;'''

engine.execute(string_change)

# check the updated results
string = '''
SELECT customerNumber, customerName, salesRepEmployeeNumber
FROM customers
WHERE customerNumber IN (125, 169, 206, 223, 237, 247, 273, 293, 303, 307, 335, 348, 356,
       361, 369, 409, 443, 459, 465, 477, 480, 481)
;'''

df1 = pd.read_sql(string, engine)

# reset the salesRepEmployeeNumber of customers table
# to original NULL value
string_change = '''
UPDATE customers
SET salesRepEmployeeNumber = NULL
WHERE customerNumber IN (125, 169, 206, 223, 237, 247, 273, 293, 303, 307, 335, 348, 356,
       361, 369, 409, 443, 459, 465, 477, 480, 481)
;'''

engine.execute(string_change)

df1.head()

,customerNumber,customerName,salesRepEmployeeNumber
0,125,Havel & Zbyszek Co,1612
1,169,Porto Imports Co.,1370
2,206,"Asian Shopping Network, Co",1619
3,223,Natürlich Autos,1611
4,237,ANG Resellers,1165

In [16]:
# query the customers that have no sales representative
df2 = (
    pd.read_sql_table('customers', engine)
    .query('salesRepEmployeeNumber.isnull()')
    [['customerNumber', 'customerName', 'salesRepEmployeeNumber']]
    .reset_index(drop=True)
)

customerNumber = df2['customerNumber'].to_list()

# randomly select sales representative from employees table
employeeNumber = (
    pd.read_sql_table('employees', engine)
    .query("jobTitle == 'Sales Rep'")
    .sample(n=len(customerNumber), replace=True, random_state=1)
    ['employeeNumber']
    .to_list()
)

# assig the sales representative to the customers
df2.salesRepEmployeeNumber = employeeNumber

df2.head()

,customerNumber,customerName,salesRepEmployeeNumber
0,125,Havel & Zbyszek Co,1323
1,169,Porto Imports Co.,1611
2,206,"Asian Shopping Network, Co",1612
3,223,Natürlich Autos,1401
4,237,ANG Resellers,1501

In [17]:
# recheck the original table
pd.read_sql(string, engine).head()

,customerNumber,customerName,salesRepEmployeeNumber
0,125,Havel & Zbyszek Co,None
1,169,Porto Imports Co.,None
2,206,"Asian Shopping Network, Co",None
3,223,Natürlich Autos,None
4,237,ANG Resellers,None